theatrus/ksdk/platform/CMSIS/Include/device/MKV31F51212/MKV31F51212_registers.h
/*
 * Constants & macros for individual UART_WP7816A_T1 bitfields
 */

/*!
 * @name Register UART_WP7816A_T1, field BWI_H[7:0] (RW)
 *
 * Used to calculate the value used for the BWT counter. This register field
 * provides the most significant byte of the 16 bit Block Wait Time Integer field
 * BWI formed by {WP7816A_T1[BWI_H], WP7816B_T1[BWI_L]}. The value of BWI = 0 is
 * invalid and should not be programmed. This value is used only when C7816[TTYPE]
 * = 1. See Wait time and guard time parameters.
 */
/*@{*/
#define BP_UART_WP7816A_T1_BWI_H (0U)      /*!< Bit position for UART_WP7816A_T1_BWI_H. */
#define BM_UART_WP7816A_T1_BWI_H (0xFFU)   /*!< Bit mask for UART_WP7816A_T1_BWI_H. */
#define BS_UART_WP7816A_T1_BWI_H (8U)      /*!< Bit field size in bits for UART_WP7816A_T1_BWI_H. */

/*! @brief Read current value of the UART_WP7816A_T1_BWI_H field. */
#define BR_UART_WP7816A_T1_BWI_H(x) (HW_UART_WP7816A_T1(x).U)

/*! @brief Format value for bitfield UART_WP7816A_T1_BWI_H. */
#define BF_UART_WP7816A_T1_BWI_H(v) ((uint8_t)((uint8_t)(v) << BP_UART_WP7816A_T1_BWI_H) & BM_UART_WP7816A_T1_BWI_H)

/*! @brief Set the BWI_H field to a new value. */
#define BW_UART_WP7816A_T1_BWI_H(x, v) (HW_UART_WP7816A_T1_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_UART_WP7816B_T1 - UART 7816 Wait Parameter Register B
 ******************************************************************************/

/*!
 * @brief HW_UART_WP7816B_T1 - UART 7816 Wait Parameter Register B (RW)
 *
 * Reset value: 0x14U
 *
 * The WP7816B_T1 register contains constants used in the generation of various
 * wait time counters. To save register space, this register is used differently
 * when C7816[TTYPE] = 0 and C7816[TTYPE] = 1. This register may be read at any
 * time. This register must be written to only when C7816[ISO_7816E] is not set.
 */
typedef union _hw_uart_wp7816b_t1
{
    uint8_t U;
    struct _hw_uart_wp7816b_t1_bitfields
    {
        uint8_t BWI_L : 8;             /*!< [7:0] Block Wait Time Integer Low
                                        * (C7816[TTYPE] = 1) */
    } B;
} hw_uart_wp7816b_t1_t;

/*!
 * @name Constants and macros for entire UART_WP7816B_T1 register
 */
/*@{*/
#define HW_UART_WP7816B_T1_ADDR(x) ((uint32_t)(x) + 0x3DU)

#define HW_UART_WP7816B_T1(x)    (*(__IO hw_uart_wp7816b_t1_t *) HW_UART_WP7816B_T1_ADDR(x))
#define HW_UART_WP7816B_T1_RD(x) (HW_UART_WP7816B_T1(x).U)
#define HW_UART_WP7816B_T1_WR(x, v) (HW_UART_WP7816B_T1(x).U = (v))
#define HW_UART_WP7816B_T1_SET(x, v) (HW_UART_WP7816B_T1_WR(x, HW_UART_WP7816B_T1_RD(x) |  (v)))
#define HW_UART_WP7816B_T1_CLR(x, v) (HW_UART_WP7816B_T1_WR(x, HW_UART_WP7816B_T1_RD(x) & ~(v)))
#define HW_UART_WP7816B_T1_TOG(x, v) (HW_UART_WP7816B_T1_WR(x, HW_UART_WP7816B_T1_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_WP7816B_T1 bitfields
 */

/*!
 * @name Register UART_WP7816B_T1, field BWI_L[7:0] (RW)
 *
 * Used to calculate the value used for the BWT counter. This register field
 * provides the least significant byte of the 16 bit Block Wait Time Integer field
 * BWI formed by {WP7816A_T1[BWI_H], WP7816B_T1[BWI_L]}. The value of BWI = 0 is
 * invalid and should not be programmed. This value is used only when C7816[TTYPE]
 * = 1. See Wait time and guard time parameters.
 */
/*@{*/
#define BP_UART_WP7816B_T1_BWI_L (0U)      /*!< Bit position for UART_WP7816B_T1_BWI_L. */
#define BM_UART_WP7816B_T1_BWI_L (0xFFU)   /*!< Bit mask for UART_WP7816B_T1_BWI_L. */
#define BS_UART_WP7816B_T1_BWI_L (8U)      /*!< Bit field size in bits for UART_WP7816B_T1_BWI_L. */

/*! @brief Read current value of the UART_WP7816B_T1_BWI_L field. */
#define BR_UART_WP7816B_T1_BWI_L(x) (HW_UART_WP7816B_T1(x).U)

/*! @brief Format value for bitfield UART_WP7816B_T1_BWI_L. */
#define BF_UART_WP7816B_T1_BWI_L(v) ((uint8_t)((uint8_t)(v) << BP_UART_WP7816B_T1_BWI_L) & BM_UART_WP7816B_T1_BWI_L)

/*! @brief Set the BWI_L field to a new value. */
#define BW_UART_WP7816B_T1_BWI_L(x, v) (HW_UART_WP7816B_T1_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_WGP7816_T1 - UART 7816 Wait and Guard Parameter Register
 ******************************************************************************/

/*!
 * @brief HW_UART_WGP7816_T1 - UART 7816 Wait and Guard Parameter Register (RW)
 *
 * Reset value: 0x06U
 *
 * The WGP7816_T1 register contains constants used in the generation of various
 * wait and guard timer counters. This register may be read at any time. This
 * register must be written to only when C7816[ISO_7816E] is not set.
 */
typedef union _hw_uart_wgp7816_t1
{
    uint8_t U;
    struct _hw_uart_wgp7816_t1_bitfields
    {
        uint8_t BGI : 4;               /*!< [3:0] Block Guard Time Integer (C7816[TTYPE] =
                                        * 1) */
        uint8_t CWI1 : 4;              /*!< [7:4] Character Wait Time Integer 1
                                        * (C7816[TTYPE] = 1) */
    } B;
} hw_uart_wgp7816_t1_t;

/*!
 * @name Constants and macros for entire UART_WGP7816_T1 register
 */
/*@{*/
#define HW_UART_WGP7816_T1_ADDR(x) ((uint32_t)(x) + 0x3EU)

#define HW_UART_WGP7816_T1(x)    (*(__IO hw_uart_wgp7816_t1_t *) HW_UART_WGP7816_T1_ADDR(x))
#define HW_UART_WGP7816_T1_RD(x) (HW_UART_WGP7816_T1(x).U)
#define HW_UART_WGP7816_T1_WR(x, v) (HW_UART_WGP7816_T1(x).U = (v))
#define HW_UART_WGP7816_T1_SET(x, v) (HW_UART_WGP7816_T1_WR(x, HW_UART_WGP7816_T1_RD(x) |  (v)))
#define HW_UART_WGP7816_T1_CLR(x, v) (HW_UART_WGP7816_T1_WR(x, HW_UART_WGP7816_T1_RD(x) & ~(v)))
#define HW_UART_WGP7816_T1_TOG(x, v) (HW_UART_WGP7816_T1_WR(x, HW_UART_WGP7816_T1_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_WGP7816_T1 bitfields
 */

/*!
 * @name Register UART_WGP7816_T1, field BGI[3:0] (RW)
 *
 * Used to calculate the value used for the BGT counter. It represent a value
 * between 0 and 15. This value is used only when C7816[TTYPE] = 1. See Wait time
 * and guard time parameters .
 */
/*@{*/
#define BP_UART_WGP7816_T1_BGI (0U)        /*!< Bit position for UART_WGP7816_T1_BGI. */
#define BM_UART_WGP7816_T1_BGI (0x0FU)     /*!< Bit mask for UART_WGP7816_T1_BGI. */
#define BS_UART_WGP7816_T1_BGI (4U)        /*!< Bit field size in bits for UART_WGP7816_T1_BGI. */

/*! @brief Read current value of the UART_WGP7816_T1_BGI field. */
#define BR_UART_WGP7816_T1_BGI(x) (HW_UART_WGP7816_T1(x).B.BGI)

